{
    "version": "https://jsonfeed.org/version/1",
    "title": "Bakery",
    "description": "",
    "home_page_url": "https://bakery.ar",
    "feed_url": "https://bakery.ar/feed.json",
    "user_comment": "",
    "author": {
        "name": "Ami Reynoso"
    },
    "items": [
        {
            "id": "https://bakery.ar/cream-cheese-banana-muffins/",
            "url": "https://bakery.ar/cream-cheese-banana-muffins/",
            "title": "Cream cheese banana muffins",
            "summary": "My all-time most requested muffins. I started making these in 2016 and they get better every time I make them.",
            "content_html": "<p>My all-time most requested muffins. I started making these in 2016 and they get better every time I make them. The original recipe is from <a href=\"https://tasty.co/recipe/cream-cheese-filled-banana-bread-muffins\">Tasty</a>, but I adapted it to what I had at hand the first few times I made it (sour cream wasn't readily available in Buenos Aires back then).</p>\n<h2>Ingredients</h2>\n<h3>Banana batter</h3>\n<ul>\n<li>1 large egg</li>\n<li>100g brown sugar</li>\n<li>50g granulated sugar</li>\n<li>120g butter, melted</li>\n<li>100ml whipping cream (can be replace by 60ml sour cream)</li>\n<li>5ml vanilla extract</li>\n<li>2 ripe bananas</li>\n<li>1 tsp baking powder</li>\n<li>150g all-purpose flour</li>\n</ul>\n<h3>Cream cheese filling</h3>\n<ul>\n<li>120g cream cheese, softened</li>\n<li>1 large egg</li>\n<li>50g granulated sugar</li>\n<li>3 tbsp all-purpose flour</li>\n</ul>\n<h2>Preparation</h2>\n<ol>\n<li>Preheat the oven to 350ºF</li>\n<li>Whip the cream to stiff peaks</li>\n<li>Mix together egg, vanilla, sugars, melted butter and whipped cream</li>\n<li>Mash the bananas into the mixture</li>\n<li>Mix in the flour and baking powder</li>\n<li>Set aside</li>\n<li>In another bowl, mix the softened cream cheese, with the egg, flour and sugar</li>\n<li>Line a muffin tin and fill the muffin cups with the batters in three layers:\n<ol>\n<li>1/3 banana mix</li>\n<li>1/3 cream cheese mix</li>\n<li>1/3 banana mix</li>\n</ol>\n</li>\n<li>Sprinkle the tops with a bit of granulated sugar</li>\n<li>Bake for 25 minutes or until done</li>\n</ol>",
            "image": "https://bakery.ar/media/posts/19/IMG_4275.jpeg",
            "author": {
                "name": "Ami Reynoso"
            },
            "tags": [
                   "muffins",
                   "cream cheese",
                   "banana"
            ],
            "date_published": "2021-11-21T12:49:18-05:00",
            "date_modified": "2021-11-21T19:57:09-05:00"
        },
        {
            "id": "https://bakery.ar/blueberry-muffins/",
            "url": "https://bakery.ar/blueberry-muffins/",
            "title": "Blueberry muffins",
            "summary": "Recipe from King Arthur Baking with slight adjustments to my taste. Preheat the oven to 375°F They can be frozen,&hellip;",
            "content_html": "<p class=\"msg msg--info\">Recipe from <a href=\"https://www.kingarthurbaking.com/recipes/famous-department-store-blueberry-muffins-recipe\" target=\"_blank\" rel=\"noopener\">King Arthur Baking</a> with slight adjustments to my taste.</p>\n<h2><figure class=\"post__image\"><img loading=\"lazy\"  style=\"color: var(--text-editor-body-color); font-family: var(--font-base); font-size: inherit; font-weight: var(--font-weight-normal);\" src=\"https://bakery.ar/media/posts/18/blueberry-muffins.jpg\" sizes=\"(max-width: 48em) 100vw, 100vw\" srcset=\"https://bakery.ar/media/posts/18/responsive/blueberry-muffins-xs.jpg 300w ,https://bakery.ar/media/posts/18/responsive/blueberry-muffins-sm.jpg 480w ,https://bakery.ar/media/posts/18/responsive/blueberry-muffins-md.jpg 768w\"  alt=\"Blueberry muffins\" width=\"2928\" height=\"2535\"></figure></h2>\n<h2>Ingredients</h2>\n<ul class=\"list--bullets\">\n<li>115g room-temperature butter</li>\n<li>200g sugar</li>\n<li>2 large eggs</li>\n<li>2 tsp baking powder</li>\n<li>1/2 tsp salt</li>\n<li>1 1/2 tsp vanilla extract</li>\n<li>240g all-purpose flour</li>\n<li>115g milk</li>\n<li>250g fresh or frozen blueberries</li>\n<li>50g sugar (for topping)</li>\n</ul>\n<h2>Directions</h2>\n<ol class=\"list--numbers\">\n<li class=\"field__item\">\n<p>Preheat the oven to 375°F</p>\n</li>\n<li>Prepare a muffin tin, lining it with muffin paper cups</li>\n<li>Beat together the butter and sugar until well combined in a bowl</li>\n<li>Add the eggs one at a time, and scrape the bowl after each addition</li>\n<li>Add the baking powder, salt, and vanilla</li>\n<li>Add the milk and the flour alternating them, scraping the bowl regularly:\n<ol class=\"list--numbers\">\n<li>A third of the milk</li>\n<li>Half of the flour</li>\n<li>Half of the remaining milk</li>\n<li>The rest of the flour</li>\n<li>The rest of the milk</li>\n</ol>\n</li>\n<li>Add the blueberries and mix well</li>\n<li>Scoop the mixture on the tin using a 1/4 cup measure or #16 disher (ice-cream scoop)</li>\n<li>Sprinkle sugar on top of each muffin</li>\n<li>Bake for about 30 minutes, until light golden brown on top and a cake tester comes out clean on the center of a muffin</li>\n<li>Remove from the oven and transfer to a cooling rack after 5 minutes</li>\n</ol>\n<p class=\"msg msg--highlight \">They can be frozen, bake them at a 350°F oven for 5 minutes before serving</p>",
            "image": "https://bakery.ar/media/posts/18/IMG_4201.jpeg",
            "author": {
                "name": "Ami Reynoso"
            },
            "tags": [
                   "muffins",
                   "blueberry"
            ],
            "date_published": "2021-08-13T20:26:00-04:00",
            "date_modified": "2021-09-05T20:29:27-04:00"
        },
        {
            "id": "https://bakery.ar/madeleines/",
            "url": "https://bakery.ar/madeleines/",
            "title": "Madeleines",
            "summary": "I had never had madeleines before trying this recipe (which I had to make for my Cookies class), and I&hellip;",
            "content_html": "<p>I had never had madeleines before trying this recipe (which I had to make for my Cookies class), and I must say they were a huge hit. Turns out the hump they get when baking is a good thing, even though it looks like something went wrong.</p>\n<figure class=\"post__image\" ><img loading=\"lazy\" src=\"https://bakery.ar/media/posts/17/IMG_3204.jpeg\" sizes=\"(max-width: 48em) 100vw, 100vw\" srcset=\"https://bakery.ar/media/posts/17/responsive/IMG_3204-xs.jpeg 300w ,https://bakery.ar/media/posts/17/responsive/IMG_3204-sm.jpeg 480w ,https://bakery.ar/media/posts/17/responsive/IMG_3204-md.jpeg 768w\"  alt=\"\" width=\"4032\" height=\"3024\">\n<figcaption >Right out of the oven... with the hump!</figcaption>\n</figure>\n<p>There's a few gotchas with these cake-like cookies, though:</p>\n<ol>\n<li>You need a special pan</li>\n<li>The batter needs to rest overnight, so you need to make them the day before baking</li>\n<li>They have a very short shelf life</li>\n</ol>\n<p>They're worth it!</p>\n<h2>Ingredients</h2>\n<ul>\n<li>150g butter</li>\n<li>140g sugar</li>\n<li>25g honey</li>\n<li>4g salt</li>\n<li>3 large eggs</li>\n<li>zest of 1 lemon</li>\n<li>150g pastry flour</li>\n<li>4g baking powder</li>\n</ul>\n<h2>Directions</h2>\n<ol>\n<li>Melt the butter</li>\n<li>In the bowl of a standing mixer, add the sugar, eggs, honey, lemon and salt</li>\n<li>Mix on high speed with the whisk attachment until almost ribbon stage (about 5 minutes)</li>\n<li>Sift the pastry flour and the baking powder on the bowl and gently fold them in with a spatula or bowl scraper</li>\n<li>Add the melted butter and fold in gently</li>\n<li>Cover and chill the batter overnight on the fridge</li>\n<li>When ready to bake, preheat the oven to 350ºF</li>\n<li>Fill the moulds about 3/4 full (for my size of pan, I used a number 40 ice cream scoop)</li>\n<li>Bake for about 6 to 7 minutes or until golden</li>\n<li>Carefully remove them from the moulds and let them rest on a cooling rack</li>\n</ol>",
            "image": "https://bakery.ar/media/posts/17/IMG_3207.jpeg",
            "author": {
                "name": "Ami Reynoso"
            },
            "tags": [
                   "lemon",
                   "cookies",
                   "cakes"
            ],
            "date_published": "2021-04-03T16:10:00-04:00",
            "date_modified": "2021-07-10T16:20:31-04:00"
        },
        {
            "id": "https://bakery.ar/strawberry-and-cream-tart/",
            "url": "https://bakery.ar/strawberry-and-cream-tart/",
            "title": "Strawberry and cream tart",
            "summary": "First off… yes, I know this should be called a “flan” and not a “tart” (the difference is on the&hellip;",
            "content_html": "<p>First off… yes, I know this should be called a “flan” and not a “tart” (the difference is on the size, flan is big, tart is small), but I flat out refuse to call this a flan. To me, a flan is a custard and nothing will change my mind. So I’m calling this a tart while it technically isn’t. But who cares about technicalities.</p>\n<p>I’ve tried many different recipies for strawberry tart over the years. My go-to was a recipe for strawberry mini tarts that were cute but were only good right after making. The whipped cream always turned gooey after the first day.</p>\n<p>There is a bakery in Buenos Aires, a couple of blocks away from my in-law’s home that makes this beautiful and delicious strawberry tart that we used to get for every celebratory occasion. The crust is thick and crumbly, it has a generous layer of whipped cream inside and a lot of strawberries, glazed with a strawberry-flavoured jelly, and it’s topped with the most beautifully silky whipped cream swirls. It’s just perfect.</p>\n<p>Seb challenged me to replicate it. And I tried, working striclty from memory because it’s been over 2 years since the last time I had had it. It turned out pretty good!</p>\n<p>My biggest challenge was to figure out how to get the whipped cream hold its shape. Every time I made whipped cream, it became soupy after a while. I found out that the trick is to stabilize the cream. I used unflavoured gelatin and it worked wonderfully.</p>\n<p>I also had to figure out how to have the crust to come out nice and crumbly, just how I remembered it. After doing some research, I came to the conclusion that I had to go with a <em>pâte sablée</em> dough, so I ended up using my <a href=\"https://bakery.ar/lemon-meringue-pie/\">lemon meringue pie dough recipe</a>.</p>\n<h3 id=\"ingredients\">Ingredients</h3>\n<h4 id=\"crust\">Crust</h4>\n<ul>\n<li>100g powdered sugar</li>\n<li>200g room-temperature butter</li>\n<li>300g all-purpose flour</li>\n<li>1 egg</li>\n<li>Pinch of salt</li>\n</ul>\n<h4 id=\"filling\">Filling</h4>\n<ul>\n<li>500g fresh strawberries</li>\n<li>1 red glaze envelope</li>\n<li>3/4 cup sugar</li>\n<li>3/4 cup boiling hot water</li>\n</ul>\n<h4 id=\"chantilly\">Chantilly</h4>\n<ul>\n<li>2 cups fresh whipping cream</li>\n<li>8 tbsp powdered sugar</li>\n<li>2 tsp vanilla extract</li>\n<li>2 1/2 tbsp (1 envelope) unflavoured gelatin</li>\n<li>2 tbsp water</li>\n</ul>\n<h3 id=\"directions\">Directions</h3>\n<ol>\n<li>In the bowl of a standing mixer, beat the butter slowly until soft and creamy. Add the powdered sugar slowly, and then increase the speed.</li>\n<li>When the consistency becomes creamy and the colour lightens, add the egg and keep mixing.</li>\n<li>Add the flour and salt, and mix slowly until a firm dough forms. Do not overmix.</li>\n<li>Form a circle with the dough and cover with plastic wrap. Take to the fridge to rest for at least 30 minutes.</li>\n<li>Once chilled, roll the dough in a floured surface. Cover the pie dish and press against the side. Try to use all the dough, this layer needs to be thich. Tap base with a fork.</li>\n<li>Cover the dish and dough with aluminium foil and press. Add baking weights.</li>\n<li>Take to a pre-heated 350°F oven for about 15 minutes. After that time, remove the weights and foil, and cook for 5 more minutes. Let cool after taking out of the oven.</li>\n<li>While the dough bakes, chill the standing mixer’s bowl (use a metal one if possible), alongside the mixer’s whip attachment, for at least 15 minutes.</li>\n<li>Prepare the gelatin by mixing the powder with the water in a microwave-safe bowl. Let it sit for a couple of minutes, until the granules stretch. Heat in the microwave for 5-10 seconds until the gelatin liquifies. Set aside.</li>\n<li>Start whipping the cream. Once thick, slowly incorporate the sugar. Once mixed, incorporate the vanilla extract. Once soft peaks form, incorporate the gelatin as the cream beats in a thin stream. Continue beating, keeking an eye on it, until stiff peaks form.</li>\n<li>Transfer chantilly to a decorating bag. Use about 2/3 of the chantilly to fill the crust. Chill the rest of the cream.</li>\n<li>Wash and remove stems from the strawberries. Cut them in slices. Lay the around 2/3 of the slices over the cream layer.</li>\n<li>Mix the red glaze with the sugar in a big bowl and incorporate the boiling water, 1/4 cup at a time. Mix well until desired thickness forms. Add the rest of the strawberry slices to the glaze and mix well.</li>\n<li>Cover the pie with the glazed strawberry slices, ensuring the entire pie is covered. Chill for at least one hour before decoratinh.</li>\n<li>Using the piping bag with a star tip, decorate the pie with the remaining chantilly. Chill for at least 1 more hour before serving.</li>\n</ol>\n",
            "image": "https://bakery.ar/media/posts/16/strawberry-cream-tart.jpeg",
            "author": {
                "name": "Ami Reynoso"
            },
            "tags": [
                   "whipped cream",
                   "tarts",
                   "strawberry"
            ],
            "date_published": "2020-08-28T20:18:00-04:00",
            "date_modified": "2021-07-09T20:52:30-04:00"
        },
        {
            "id": "https://bakery.ar/cinnamon-rolls/",
            "url": "https://bakery.ar/cinnamon-rolls/",
            "title": "Cinnamon rolls",
            "summary": "I’d had this very intense cinnamon roll craving for a while until I decided to act on it while watching&hellip;",
            "content_html": "<p>I’d had this very intense cinnamon roll craving for a while until I decided to act on it while watching Hamilton one summer weekend. It was quite late in the afternoon and from what I knew, cinnamon rolls take a couple of hours to make. Because I was lazy <em>and</em> hungry, I searched for the quickest cinnamon roll recipe.</p>\n<p>I came across <a href=\"https://therecipecritic.com/quick-45-minute-cinnamon-rolls/\">this beautiful recipe</a> by The Recipe Critic, and it turned out to be amazing! I only modified it slightly to make it more to my tasting.</p>\n<p>I made a big batch and had to freeze the rest in order to force myself not to eat them all in one sitting. They were that good.</p>\n<h3 id=\"ingredients\">Ingredients</h3>\n<h4 id=\"dough\">Dough</h4>\n<ul>\n<li>2 3/4 cups all-purpose flour</li>\n<li>3 tbsp sugar</li>\n<li>1 tsp salt</li>\n<li>2 1/4 tsp instant yeast (1 package)</li>\n<li>1/2 cup water</li>\n<li>1/4 cup milk</li>\n<li>2 tbsp unsalted butter</li>\n<li>1 large egg</li>\n<li>zest of 1 orange or lemon</li>\n</ul>\n<h4 id=\"filling\">Filling</h4>\n<ul>\n<li>60 g unsalted butter at room temperature</li>\n<li>1/4 cup brown sugar</li>\n<li>1/2 tbsp cinnamon</li>\n</ul>\n<h4 id=\"glaze\">Glaze</h4>\n<ul>\n<li>1 cup powdered sugar</li>\n<li>1 tsp vanilla extract</li>\n<li>2-3 tbps milk</li>\n</ul>\n<h3 id=\"directions\">Directions</h3>\n<ol>\n<li>In the bowl of a standing mixer, mix the flour, sugar, salt, zest and yeast. Set aside.</li>\n<li>In a bowl apt for microwaving (I use a measuing jar), heat the water, milk and butter for 30-45 seconds in the microwave, 1ntil the butter is melted.</li>\n<li>Pour the liquid mixture into the bowl of the standing mixer.</li>\n<li>Add the egg (I always crack the egg in a ramekin first).</li>\n<li>Knead in medium speed for 3-4 minutes until the dough is no longer sticky.</li>\n<li>Set the bowl aside and cover it with a damp towel. Let rest for at least 5 minutes.</li>\n<li>Preheat the oven to 200ºF.</li>\n<li>Mix the softened butter with the sugar and the cinnamon.</li>\n<li>After the dough has rested, roll it out to a big rectangle.</li>\n<li>Spread the butter mixture evenly on top.</li>\n<li>Roll up the dough tightly. Cut into 8-9 even pieces.</li>\n<li>Turn off the oven.</li>\n<li>Place the rolls in a lightly greased pan (I used a pie plate). Cover with plastic wrap.</li>\n<li>Place the pan in the turned off oven for about 20 minutes, so rolls can rise.</li>\n<li>After 20 minutes, or when rolls have doubled in size, remove pan from the oven and remove the plastic wrap.</li>\n<li>Turn on the oven to 375ºF. Wait until oven has reached this temperature before putting the pan back in the oven.</li>\n<li>Bake cinnamon rolls for 15-20 minutes, until golden.</li>\n<li>While rolls bake, make the glaze by mixing the powdered sugar, vanilla extract and milk until smooth.</li>\n<li>Remove the pan from the oven and top rolls with glaze. Cool before serving.</li>\n</ol>\n",
            "image": "https://bakery.ar/media/posts/12/cinnamon-rolls.jpeg",
            "author": {
                "name": "Ami Reynoso"
            },
            "tags": [
                   "cinnamon",
                   "bread"
            ],
            "date_published": "2020-07-04T18:47:00-04:00",
            "date_modified": "2021-07-09T18:59:47-04:00"
        },
        {
            "id": "https://bakery.ar/medialunas/",
            "url": "https://bakery.ar/medialunas/",
            "title": "Medialunas",
            "summary": "If you go to any bakery in Argentina (in Buenos Aires you’ll see one every two blocks), you’ll find lots&hellip;",
            "content_html": "<p>If you go to any bakery in Argentina (in Buenos Aires you’ll see one every two blocks), you’ll find lots of <em>medialunas</em>. They’re very similar to <em>croissants</em> in shape but the texture is slightly different. </p>\n<p>There are many types of medialunas: butter-style, lard-style, filled with dulce de leche, filled with ham and cheese. They’re a very versatile type of pastry so they pair well with pretty much everything.</p>\n<p>I also find the name <em>medialuna</em> magical. It means half-moon, and it obviously refers to its shape.</p>\n<p>I hadn’t had medialunas since I moved to Canada, and for some reason, there was a week where all Instagram showed me was recipes of medialunas. It was a sign (<em>that I share too much information with Facebook maybe</em>). I had never made them before so I ventured to try it. I knew they usually take a long time to make, so I obviously looked for the quickest recipe.</p>\n<p>This recipe makes a huge batch (I think around 30, depending on the size). I froze most of them, so they’re super convenient anytime, especially for breakfast. Seb loves them with ham and cheese (like a sandwich)! Just take them out of the freezer, warm them for 45 seconds on the microwave, fill them with whatever you want and bake for 5 minutes in a 300°F oven. Voilà!</p>\n<h3 id=\"ingredients\">Ingredients</h3>\n<h4 id=\"dough\">Dough</h4>\n<ul>\n<li>10g active dry yeast</li>\n<li>480g all-purpose flour</li>\n<li>50g room-temperature butter</li>\n<li>1 egg</li>\n<li>40g sugar</li>\n<li>250ml milk</li>\n<li>125ml water</li>\n<li>Pinch of salt</li>\n<li>1 egg (for egg wash)</li>\n</ul>\n<h4 id=\"syrup\">Syrup</h4>\n<ul>\n<li>100g sugar</li>\n<li>100ml water</li>\n<li>2 slices of any citrus fruit (i.e. lemon, orange, lime)</li>\n</ul>\n<h3 id=\"directions\">Directions</h3>\n<ol>\n<li>In the bowl of a standing mixer, using a knead hook, mix the yeast with the flour well.</li>\n<li>Add the butter and mix with until incorporated.</li>\n<li>Add the egg and the sugar and keep kneading.</li>\n<li>Slowly add the water until the dough forms. Knead for a couple of minutes. The dough should be sticky so don’t add more flour.</li>\n<li>Cover the dough with a damp towel and place in a warm surface (the stovetop should do fine).</li>\n<li>Once the dough has doubled in size, transfer to a floured surface. Roll into a rectangular shape until the dough is about 1 cm thick.</li>\n<li>Cut the dough in triangles. Shape the triangles into a crescent shape. To do this, put the triangle facing you upside down. Then roll it with your hands towards you.</li>\n<li>Place the medialunas in a baking sheet lined with parchment paper. Have each medialuna rest on the tips of the previous one (see pictures for reference), but leave some space between each other because they still need to rise one more time.</li>\n<li>Let them rest in shape for about 10 more minutes or until risen. Paint them with an egg wash.</li>\n<li>Bake in a pre-heated oven at 350°F for 15 minutes or until golden brown.</li>\n<li>While they bake, make the syrup. In a small saucepan add the water, sugar and citrus slices. Don’t mix it and let it bring to a boil. When big bubbles form, turn off the heat.</li>\n<li>Once the medialunas are out of the oven, brush the top with the syrup.</li>\n</ol>\n",
            "image": "https://bakery.ar/media/posts/11/medialunas.jpeg",
            "author": {
                "name": "Ami Reynoso"
            },
            "tags": [
                   "confections",
                   "bread"
            ],
            "date_published": "2020-06-27T18:47:00-04:00",
            "date_modified": "2021-07-09T19:00:13-04:00"
        },
        {
            "id": "https://bakery.ar/angel-food-cake/",
            "url": "https://bakery.ar/angel-food-cake/",
            "title": "Angel food cake",
            "summary": "The first time I had Angel food cake was in the summer of 2019, after my husband Seb found a&hellip;",
            "content_html": "<p>The first time I had Angel food cake was in the summer of 2019, after my husband Seb found a Betty Crocker Angel food cake box “very appealing” in the supermarket. It certainly looked very interesting: white and airy. I was super curious to find out what it tasted like. We had never heard of this type of cake back in Argentina.</p>\n<p>It was only when we got home that I learned that I needed a special tin for this cake. Luckily, I had a non-stick bundt cake pan, and after some Googling, I confirmed it could replace the original Angel food cake pan just fine.</p>\n<p>I made the cake following the box instructions (including trying to figure out how to rest the cake upside down… 🤔). Tasting time comes… I loved the cake. Seb… not so much. He didn’t appreciate the almond flavoring.</p>\n<p>A couple of months later, I decided to make this cake from scratch. I found a simple enough recipe on <a href=\"https://tasty.co/recipe/angel-food-cake-in-a-springform-pan\">Tasty</a> and it turned out beautifully. Needless to say, I don’t use almond extract in the homemade version.</p>\n<h3 id=\"ingredients\">Ingredients</h3>\n<ul>\n<li>1 cup all-purpose flour</li>\n<li>1 1/4 cups egg whites</li>\n<li>1 1/2 cups sugar</li>\n<li>1 tsp vanilla extract</li>\n<li>pinch of salt</li>\n</ul>\n<h3 id=\"directions\">Directions</h3>\n<ol>\n<li>Preheat oven to 350ºF.</li>\n<li>Sift the flour and 1/2 cup of the sugar in a medium bowl. Reserve.</li>\n<li>Measure the egg whites (I buy pasteurized egg whites, refer to the original Tasty recipe if you have whole eggs – you’ll need to use cream of tartar).</li>\n<li>In the bowl of a standing mixer, combine the egg whites, vanilla extract and salt. Beat in medium speed until soft peaks form.</li>\n<li>Increase the mixer speed and gradually incorporate the remaining 1 cup of sugar, 2 tablespoons at a time. Keep beaing until stiff peaks form.</li>\n<li>Carfully sift the flour and sugar mixture into the egg whites mixture. Do this incrementally, 1/4 cup at a time. Fold softly with a spatula until there are no clumps left. Be careful not to overmix.</li>\n<li>Transfer the batter into a non-greased non-stick bundt cake pan.</li>\n<li>Bake for 45 minutes, or until the cake has risen and the top is golden brown.</li>\n<li>While th cake bakes, prepare a wire rack and devise an “inverted cake holder”, as I like to call it. You need to invert the cake when it comes out of the oven, so find something you can use to keep it in place. I normally use the lid of my dutch oven, which has a flat handle (I rest the center of the inverted pan on the lid handle).</li>\n<li>Remove the cake from the oven and invert immediately. </li>\n<li>Let it cool for at least 45 minutes before removing the cake from the pan. To remove, run a spatula (or something soft as to not ruin the non-stick surface of the pan) along the outer edge of the pan.</li>\n<li>Serve with berries!</li>\n</ol>\n",
            "image": "https://bakery.ar/media/posts/10/angel-food-cake.jpeg",
            "author": {
                "name": "Ami Reynoso"
            },
            "tags": [
                   "meringue",
                   "cakes"
            ],
            "date_published": "2020-05-07T18:38:00-04:00",
            "date_modified": "2021-07-09T19:00:32-04:00"
        },
        {
            "id": "https://bakery.ar/lemon-meringue-pie/",
            "url": "https://bakery.ar/lemon-meringue-pie/",
            "title": "Lemon meringue pie",
            "summary": "My mom used to make lemon meringue pie (or simply Lemon Pie, as we call it back home) all the&hellip;",
            "content_html": "<p>My mom used to make lemon meringue pie (or simply <em>Lemon Pie</em>, as we call it back home) all the time. My sister Mailen absolutely loves this pie, so it would always be her treat. I confess I wasn’t a fan of this dessert, I used to think it was too sour for my taste.</p>\n<p>As I got older, I started to appreciate this delicacy more and more. Nowadays, I could kill for a slice of lemon meringue pie.</p>\n<p>I tried many, many recipes and not all attempts were successful. I tried different ways to make the filling, and in one of these attempts I came across condensed milk, and oh my. How have I lived so long without trying condensed milk?</p>\n<p>But my biggest problem always was the meringue. I tried French meringue first, because that’s how my mom does it, but it always ended up too fluffy for me and it lost its consistency if you didn’t eat it right away. I then moved on to Italian meringue and let me tell you: I hate this technique. I always messed it up – I either burnt the caramel (or it didn’t turn out syrup-y), or I burnt the egg whites. When it did come out right, the meringue over the pie would start to sweat after a day in the fridge. Not good.</p>\n<p>That is, until I tried making a Swiss meringue. The technique detailed here is not the textbook recipe, but it’s much simpler and most importantly, it works! The only gotcha is that it doesn’t last soft and creamy for too long, so the pie needs to be consumed in the first 1-3 days. Like that’s a problem…</p>\n<p><a href=\"https://www.youtube.com/watch?v=3a8_KIECzBI\">This recipe</a> comes from a TV show from Argentina, called <em>Cocineros Argentinos</em>. I watched it on YouTube. It’s long but really good. I couldn’t find the textual recipe in their website, though.</p>\n<h3 id=\"ingredients\">Ingredients</h3>\n<h4 id=\"pie-dough\">Pie dough</h4>\n<ul>\n<li>100g powdered sugar</li>\n<li>200g room-temperature butter</li>\n<li>300g all-purpose flour</li>\n<li>1 egg</li>\n<li>pinch of salt</li>\n<li>1/2 lemon zest</li>\n</ul>\n<h4 id=\"filling\">Filling</h4>\n<ul>\n<li>500ml milk</li>\n<li>200g sugar</li>\n<li>60g cornstarch</li>\n<li>4 egg yolks</li>\n<li>200ml lemon juice</li>\n<li>1/2 lemon zest</li>\n</ul>\n<h4 id=\"meringue\">Meringue</h4>\n<ul>\n<li>4 egg whites</li>\n<li>240g sugar</li>\n</ul>\n<h3 id=\"directions\">Directions</h3>\n<ol>\n<li>Mix the butter with a spatula until soft. Add the powdered sugar slowly. Once incorporated, start mixing with an electric mixer.</li>\n<li>When the consistency becomes creamy and the colour lightens, add the egg and keep mixing.</li>\n<li>Add the flour and salt, and mix with a spatula until a firm dough forms. Do not overmix.</li>\n<li>Form a circle with the dough and cover with plastic wrap. Take to the fridge to rest for at least 30 minutes.</li>\n<li>Once chilled, roll the dough in a floured surface until circle covers pie dish, or an approximate height of 1 cm.</li>\n<li>Cover the pie dish and press against the side. Cut the excess dough. Tap base with a fork.</li>\n<li>Cover the dish and dough with aluminium foil and press. Add baking weights.</li>\n<li>Take to a pre-heated 350°F oven for about 15 minutes. After that time, remove the weights and foil, and cook for 5 more minutes.</li>\n<li>While the dough bakes, start the filling. In a bowl beat the egg yolks with the sugar and cornstarch. Add the lemon juice and the zest.</li>\n<li>Bring the milk to a boil in a saucepan. Remove from heat and add about 1/4 of the milk into the yolks and sugar mixture. Mix to bring the temperature down.</li>\n<li>Put the sauce pan back in the heat until it boils again. Once it does, slowly add the other mixture into the saucepan, mixing constantly. Keep beating until consistency thickens. Once it starts to boil, keep mixing for 1 more minute and then remove from the heat.</li>\n<li>Transfer the filling into a bowl and cover with plastic wrap. Ensure the wrap touches the filling to avoid it from developing a hard film on the top. Chill it in the fridge.</li>\n<li>Once chilled, fill the cooked pie dough and leave it to rest.</li>\n<li>To make the meringue, add the egg whites and sugar into a microwave-safe bowl (or the bowl of a standing mixer is it’s glass). Mix to incorporate.</li>\n<li>Cook it on the microwave for 30 seconds. Take it out and mix it again with a whisk to prevent the egg whites from cooking. Do this process 5 times (1 time more than the amount of egg whites).</li>\n<li>Once the last round is done, transfer to the bowl of a standing mixer (if you didn’t do it in there) and beat on medium-high speed until stiff peaks form, about 8 minutes.</li>\n<li>Decorate the pie with the meringue. You can use a piping bag or just put a layer of meringue on top.</li>\n<li>Turn the oven on, using the lowest broil setting. Place the pie in the oven and keep an eye on it. Broil only until the top darkens, about 1-2 minutes.</li>\n</ol>\n",
            "image": "https://bakery.ar/media/posts/9/lemon-meringue-pie.jpeg",
            "author": {
                "name": "Ami Reynoso"
            },
            "tags": [
                   "pies",
                   "meringue",
                   "lemon"
            ],
            "date_published": "2020-04-24T18:37:00-04:00",
            "date_modified": "2021-07-09T19:01:16-04:00"
        },
        {
            "id": "https://bakery.ar/hot-cakes/",
            "url": "https://bakery.ar/hot-cakes/",
            "title": "Hot cakes",
            "summary": "Back in Argentina, we don’t really make pancakes or hot cakes as they’re commonly known in North America. Instead, we&hellip;",
            "content_html": "<p>Back in Argentina, we don’t really make pancakes or hot cakes as they’re commonly known in North America. Instead, we make crepes (which we call “panqueques”, as in <em>pancakes</em>) with lots and lots of dulce de leche (check out <a href=\"https://bakery.ar/dulce-de-leche-crepes/\">my dulce de leche crepes recipe</a>).</p>\n<p>My mom sent me this recipe to try not long ago and I was hooked because it’s so easy to make and they’re super delicious. They do not rise as much as regular pancakes, but they’re still amazing.</p>\n<h3 id=\"ingredients\">Ingredients</h3>\n<ul>\n<li>1 cup all-purpose flour</li>\n<li>1 cup milk</li>\n<li>1 egg</li>\n<li>1 tbsp sugar</li>\n<li>1 tsp baking powder</li>\n<li>pinch of salt</li>\n<li>butter</li>\n</ul>\n<h3 id=\"directions\">Directions</h3>\n<ol>\n<li>Mix all ingredients together until you get a thick and homogenous batter (I usually do this in a big measuring cup).</li>\n<li>Chill in fridge for at least 30 minutes.</li>\n<li>Brush a pancake pan pre-heated in medium heat with butter.</li>\n<li>Pour about 1/4 cup batter from measuring cup in the pan, forming a circle of about 6cm in diameter. Do not move the pan!</li>\n<li>Flip when bubbles form in the surface, about after a minute and a half.</li>\n<li>Leave for one more minute so the other side cooks.</li>\n<li>Serve hot! I like serving them with dulce de leche.</li>\n</ol>\n",
            "image": "https://bakery.ar/media/posts/8/hot-cakes.jpeg",
            "author": {
                "name": "Ami Reynoso"
            },
            "tags": [
                   "pancakes",
                   "dulce de leche"
            ],
            "date_published": "2020-03-26T18:36:00-04:00",
            "date_modified": "2021-07-09T19:01:51-04:00"
        },
        {
            "id": "https://bakery.ar/carrot-cake-loaf/",
            "url": "https://bakery.ar/carrot-cake-loaf/",
            "title": "Carrot cake loaf",
            "summary": "Earlier this year, I had ordered a veggie box that came with a lot of carrots. I made soup and&hellip;",
            "content_html": "<p>Earlier this year, I had ordered a veggie box that came with a lot of carrots. I made soup and roasted carrots for dinner, and I still had a bunch left over. So I decided to experiment with a carrot cake loaf!</p>\n<p>I love making loafs, they’re so simple and versatile and they last me many breakfasts. They’re also very convenient to freeze since once it’s sliced, it doesn’t take up a lot of space. I always have a loaf in the freezer because it’s easy peasy to take out some slices, pop them in the microwave for a minute and have a breakfast (or a <em>merienda</em>) ready in no time!</p>\n<p>I based this loaf in a recipe that I found on an healthy food Instagram account (I can’t remember which one), and as I was baking it, I adapted it to what I had in my pantry. It turned out great and my co-workers loved it!</p>\n<p>I made it so late one weeknight that I completely forgot to take a picture of it, oopsies.</p>\n<h3 id=\"ingredients\">Ingredients</h3>\n<ul>\n<li>2 carrots</li>\n<li>1 banana</li>\n<li>3 eggs</li>\n<li>1/4 cup skim milk</li>\n<li>1/2 cup brown sugar, plus extra to sprinkle</li>\n<li>1 teaspoon vanilla extract</li>\n<li>1 cup steel cut oats</li>\n<li>1/2 cup whole wheat flour</li>\n<li>1/2 cup all purpose flour</li>\n<li>1 teaspoon baking powder</li>\n<li>1 teaspoon baking soda</li>\n<li>1 teaspoon nutmeg</li>\n<li>1 teaspoon cinnamon</li>\n<li>pinch of salt</li>\n<li>walnuts to taste</li>\n</ul>\n<h3 id=\"directions\">Directions</h3>\n<h4 id=\"before-you-start-make-sure-to\">Before you start, make sure to…</h4>\n<ol>\n<li>Line a loaf tin with parchment paper.</li>\n<li>Preheat the oven to 350°F.</li>\n</ol>\n<h4 id=\"prepare-your-ingredients\">Prepare your ingredients</h4>\n<ol>\n<li>Chop the walnuts to desired size (you can do this with a food processor).</li>\n<li>Peel and shred the carrots.</li>\n<li>Mash the banana with a fork.</li>\n<li>Process the steel cut oats in a food processor until it’s similar to flour (not too fine).</li>\n<li>Mix the dry ingredients (flours, spices, salt, baking powder and soda) and reserve.</li>\n</ol>\n<h4 id=\"ready-get-set-bake\">Ready, get set, bake!</h4>\n<ol>\n<li>Whisk the eggs in a bowl for a couple of minutes.</li>\n<li>Mix in the banana, sugar, milk, and vanilla extract and keep whisking.</li>\n<li>Slowly integrate the dry ingredients while still whisking.</li>\n<li>At last, integrate the carrots and walnuts with a spatula.</li>\n<li>Pour batter into the tin.</li>\n<li>Sprinkle the top with a little of brown sugar to get a crispy crust.</li>\n<li>Bake for 35 minutes or until sticking a knife to the middle of the loaf comes out dry.</li>\n</ol>\n",
            "author": {
                "name": "Ami Reynoso"
            },
            "tags": [
                   "loaves",
                   "carrot",
                   "cakes"
            ],
            "date_published": "2020-01-20T18:34:00-05:00",
            "date_modified": "2021-07-09T18:56:57-04:00"
        }
    ]
}
